; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-18)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 room3)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room4)
(at ball10 room5)
(at ball11 room5)
(at ball12 room5)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
)
)
)

; plan
1. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 6 of 18
2. (pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 6 of 18
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 6 of 18
4. (drop ball5 room3 right)
   deleted: (carry ball5 right)
   added: (at ball5 room3) (free right)
   goals met: 7 of 18
5. (drop ball6 room3 left)
   deleted: (carry ball6 left)
   added: (at ball6 room3) (free left)
   goals met: 8 of 18
6. (pick ball12 room3 left)
   deleted: (at ball12 room3) (free left)
   added: (carry ball12 left)
   goals met: 8 of 18
7. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 8 of 18
8. (drop ball12 room5 left)
   deleted: (carry ball12 left)
   added: (at ball12 room5) (free left)
   goals met: 9 of 18
9. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 9 of 18
10. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 9 of 18
11. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 9 of 18
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 9 of 18
13. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 10 of 18
14. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 10 of 18
15. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 11 of 18
16. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 11 of 18
17. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 11 of 18
18. (pick ball11 roomb right)
   deleted: (at ball11 roomb) (free right)
   added: (carry ball11 right)
   goals met: 11 of 18
19. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 11 of 18
20. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 12 of 18
21. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 18
22. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 12 of 18
23. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 12 of 18
24. (drop ball11 room5 right)
   deleted: (carry ball11 right)
   added: (at ball11 room5) (free right)
   goals met: 13 of 18
25. (drop ball10 room5 left)
   deleted: (carry ball10 left)
   added: (at ball10 room5) (free left)
   goals met: 14 of 18
26. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 14 of 18
27. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 14 of 18
28. (pick ball14 room4 right)
   deleted: (at ball14 room4) (free right)
   added: (carry ball14 right)
   goals met: 14 of 18
29. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 14 of 18
30. (drop ball14 room5 right)
   deleted: (carry ball14 right)
   added: (at ball14 room5) (free right)
   goals met: 15 of 18
31. (drop ball15 room5 left)
   deleted: (carry ball15 left)
   added: (at ball15 room5) (free left)
   goals met: 16 of 18
32. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 16 of 18
33. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 16 of 18
34. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 16 of 18
35. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 16 of 18
36. (drop ball13 room5 left)
   deleted: (carry ball13 left)
   added: (at ball13 room5) (free left)
   goals met: 17 of 18
37. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 17 of 18
38. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 17 of 18
39. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 17 of 18
40. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 17 of 18
41. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 18 of 18
